ArakniD/Lion-IRVT/Hardware/source/tida-010086/bts_F2837xD_8ch/com_cpu2.c
static const float32_t defaultVoutOffset_pu[NUM_CHANNELS] = {
    BTS_VoutOffset_ch1_pu, BTS_VoutOffset_ch2_pu, BTS_VoutOffset_ch3_pu, BTS_VoutOffset_ch4_pu,
    BTS_VoutOffset_ch5_pu, BTS_VoutOffset_ch6_pu, BTS_VoutOffset_ch7_pu, BTS_VoutOffset_ch8_pu
};
static const float32_t defaultVoutGain_V[NUM_CHANNELS] = {
    BTS_VoutGain_ch1_V, BTS_VoutGain_ch2_V, BTS_VoutGain_ch3_V, BTS_VoutGain_ch4_V,
    BTS_VoutGain_ch5_V, BTS_VoutGain_ch6_V, BTS_VoutGain_ch7_V, BTS_VoutGain_ch8_V
};
static const float32_t defaultVoutOffset_V[NUM_CHANNELS] = {
    BTS_VoutOffset_ch1_V, BTS_VoutOffset_ch2_V, BTS_VoutOffset_ch3_V, BTS_VoutOffset_ch4_V,
    BTS_VoutOffset_ch5_V, BTS_VoutOffset_ch6_V, BTS_VoutOffset_ch7_V, BTS_VoutOffset_ch8_V
};

// mV to Temperature lookup table (placeholder)
static const struct {
    float mV;
    float tempC;
} mvToTempTable[] = {
    {500.0f, 0.0f},
    {600.0f, 10.0f},
    {700.0f, 20.0f},
    {800.0f, 30.0f},
    {900.0f, 40.0f},
    {1000.0f, 50.0f},
    {1100.0f, 60.0f},
    {1200.0f, 70.0f},
    {1300.0f, 80.0f},
    {1400.0f, 90.0f}
};
#define MV_TO_TEMP_TABLE_SIZE (sizeof(mvToTempTable) / sizeof(mvToTempTable[0]))

//
// Measured temperatures live in registers[BTS_CELLTEMP_IDX(ch)] - there is no
// separate local buffer. CPU2 is the only writer of that block.
//
static volatile uint16_t currentAdsChannel[2] = {0, 0}; // Track channel for each ADS1119

//
// Consecutive I2C failures per converter. If an ADS1119 is absent or its
// bus is wedged, every DRDY edge costs a full set of I2C timeouts; left
// unchecked that starves the console and the register interfaces. After
// this many failures the offending DRDY interrupt is masked and its
// temperatures simply stop updating.
//
#define ADS1119_MAX_CONSECUTIVE_FAILURES 8U
static volatile uint16_t adsFailCount[2] = {0, 0};

//
// Forward declarations - every ISR below is registered before it is defined.
//
__interrupt void i2cSlaveISR(void);
__interrupt void i2cTargetISR(void);
__interrupt void i2cMasterISR(void);
__interrupt void canISR(void);
__interrupt void uartRxISR(void);
__interrupt void timerISR(void);
__interrupt void ads1119Drdy1ISR(void);
__interrupt void ads1119Drdy2ISR(void);

void uartSendResponse(const char* response);
void saveCalibration(uint16_t channel);
void loadCalibration(void);
static void notifyCpu1RegisterWrite(uint16_t regIdx, float32_t value);
static void notifyCpu1CalibrationReload(void);
#if (BTS_CONSOLE_ENABLED == true)
static void formatRegisterValue(char *out, uint16_t outSize,
                                const char *name, float32_t value);
#endif

void initI2C_Slave(void)
{
    //
    // I2CA (GPIO32/33) is the host register command bus; the unit is an I2C
    // target at 0x50. The pins were muxed by CPU1 in BTS_HAL_setupCpu2Pins() -
    // the mux registers are not writable from CPU2.
    //
    I2C_disableModule(I2CA_BASE);
    I2C_setOwnAddress(I2CA_BASE, 0x50);
    I2C_setBitCount(I2CA_BASE, I2C_BITCOUNT_8);
    I2C_setConfig(I2CA_BASE, I2C_TARGET_RECEIVE_MODE);
    I2C_setEmulationMode(I2CA_BASE, I2C_EMULATION_FREE_RUN);
    I2C_enableModule(I2CA_BASE);
    I2C_enableInterrupt(I2CA_BASE,
                        I2C_INT_RX_DATA_RDY | I2C_INT_TX_DATA_RDY |
                        I2C_INT_ADDR_TARGET | I2C_INT_STOP_CONDITION);
    Interrupt_register(INT_I2CA, &i2cSlaveISR);
    Interrupt_enable(INT_I2CA);
}

void initI2C_Master(void)
{
    //
    // I2CB (GPIO40/41) carries the calibration EEPROM (0x50) and the two
    // ADS1119 temperature ADCs (0x40/0x41), whose DRDY lines are GPIO42/43.
    // Pins muxed by CPU1 in BTS_HAL_setupCpu2Pins().
    //
    I2C_disableModule(I2CB_BASE);
    I2C_initController(I2CB_BASE, DEVICE_SYSCLK_FREQ, 400000, I2C_DUTYCYCLE_50);
    I2C_setConfig(I2CB_BASE, I2C_CONTROLLER_SEND_MODE);
    I2C_setBitCount(I2CB_BASE, I2C_BITCOUNT_8);
    I2C_setEmulationMode(I2CB_BASE, I2C_EMULATION_FREE_RUN);
    I2C_enableModule(I2CB_BASE);
}

//
// Blocking byte-level EEPROM/I2C helpers. These run only at boot and on an
// explicit calibration save, so a polled implementation is appropriate.
//
static bool i2cMasterWaitBusFree(void)
{
    //
    // Bounded: these helpers are also reached from the ADS1119 DRDY ISRs, so
    // an absent or wedged device on the bus must not stall the CPU forever.
    //
    uint32_t guard = 0;
    while (I2C_isBusBusy(I2CB_BASE)) {
        if (++guard > BTS_I2C_TIMEOUT_ITERATIONS) {
            //
            // BB latches until a stop is actually seen on the wire. A
            // transfer that ended without one - a read whose stop was
            // requested but never completed, or a device that stretched
            // the clock through it - leaves the module permanently busy,
            // and from then on every setTargetAddress() write is ignored
            // and no new START is ever emitted. Without this the first
            // wedged transfer would silently disable the bus for good.
            //
            // Resetting through nIRS is the documented way out: it clears
            // BB and returns the module to its idle state. The clocking
            // configuration survives, so only the enable has to be
            // re-asserted.
            //
            I2C_disableModule(I2CB_BASE);
            SysCtl_delay(100U);
            I2C_enableModule(I2CB_BASE);
            I2C_clearStatus(I2CB_BASE,
                            I2C_STS_NO_ACK | I2C_STS_ARB_LOST |
                            I2C_STS_REG_ACCESS_RDY | I2C_STS_STOP_CONDITION);
            return !I2C_isBusBusy(I2CB_BASE);
        }
    }
    return true;
}

//
// Waits for a requested stop condition to actually appear on the bus.
//
// Bounded like every other wait here: if the stop never lands the
// module is left busy and the next caller's bus-free wait performs the
// reset, rather than this spinning forever inside an ISR.
//
static void i2cMasterWaitStopComplete(void)
{
    uint32_t guard = 0;
    while (I2C_isBusBusy(I2CB_BASE)) {
        if (++guard > BTS_I2C_TIMEOUT_ITERATIONS) {
            return;
        }
    }
}

