ArakniD/Lion-IRVT/Hardware/source/tida-010086/bts_F2837xD_8ch/com_cpu2.c
static bool i2cMasterWaitReady(void)
{
    uint32_t guard = 0;
    while ((I2C_getStatus(I2CB_BASE) & I2C_STS_REG_ACCESS_RDY) == 0U) {
        if (++guard > BTS_I2C_TIMEOUT_ITERATIONS) {
            return false;
        }
        if (I2C_getStatus(I2CB_BASE) & I2C_STS_NO_ACK) {
            I2C_clearStatus(I2CB_BASE, I2C_STS_NO_ACK);
            return false;
        }
    }
    return true;
}

//
// Writes a block to the EEPROM at a 16-bit word address.
//
static bool i2cWriteBlock(uint16_t devAddr, uint16_t memAddr,
                          const uint16_t *bytes, uint16_t count)
{
    uint16_t i;

    if (!i2cMasterWaitBusFree()) {
        return false;
    }

    I2C_setTargetAddress(I2CB_BASE, devAddr);
    I2C_setConfig(I2CB_BASE, I2C_CONTROLLER_SEND_MODE);
    I2C_setDataCount(I2CB_BASE, count + 2U);

    I2C_putData(I2CB_BASE, (memAddr >> 8) & 0xFFU);
    I2C_putData(I2CB_BASE, memAddr & 0xFFU);
    I2C_sendStartCondition(I2CB_BASE);

    for (i = 0; i < count; i++) {
        uint32_t guard = 0;
        while ((I2C_getStatus(I2CB_BASE) & I2C_STS_TX_DATA_RDY) == 0U) {
            if (++guard > BTS_I2C_TIMEOUT_ITERATIONS) {
                I2C_sendStopCondition(I2CB_BASE);
                return false;
            }
        }
        I2C_putData(I2CB_BASE, bytes[i] & 0xFFU);
    }

    I2C_sendStopCondition(I2CB_BASE);

    if (!i2cMasterWaitReady()) {
        return false;
    }

    //
    // ARDY only says the module finished its own work; the stop still
    // has to land before the bus belongs to anyone else.
    //
    i2cMasterWaitStopComplete();
    return true;
}

//
// Reads a block from the EEPROM using the usual write-address / restart-read
// sequence.
//
static bool i2cReadBlock(uint16_t devAddr, uint16_t memAddr,
                         uint16_t *bytes, uint16_t count)
{
    uint16_t i;

    if (!i2cMasterWaitBusFree()) {
        return false;
    }

    // Phase 1: write the memory address, no stop (repeated start follows).
    I2C_setTargetAddress(I2CB_BASE, devAddr);
    I2C_setConfig(I2CB_BASE, I2C_CONTROLLER_SEND_MODE);
    I2C_setDataCount(I2CB_BASE, 2U);
    I2C_putData(I2CB_BASE, (memAddr >> 8) & 0xFFU);
    I2C_putData(I2CB_BASE, memAddr & 0xFFU);
    I2C_sendStartCondition(I2CB_BASE);

    if (!i2cMasterWaitReady()) {
        I2C_sendStopCondition(I2CB_BASE);
        return false;
    }

    // Phase 2: repeated start, read count bytes.
    I2C_setConfig(I2CB_BASE, I2C_CONTROLLER_RECEIVE_MODE);
    I2C_setDataCount(I2CB_BASE, count);
    I2C_sendStartCondition(I2CB_BASE);

    for (i = 0; i < count; i++) {
        uint32_t guard = 0;
        while ((I2C_getStatus(I2CB_BASE) & I2C_STS_RX_DATA_RDY) == 0U) {
            if (++guard > BTS_I2C_TIMEOUT_ITERATIONS) {
                I2C_sendStopCondition(I2CB_BASE);
                return false;
            }
            if (I2C_getStatus(I2CB_BASE) & I2C_STS_NO_ACK) {
                I2C_clearStatus(I2CB_BASE, I2C_STS_NO_ACK);
                I2C_sendStopCondition(I2CB_BASE);
                return false;
            }
        }
        bytes[i] = I2C_getData(I2CB_BASE) & 0xFFU;
    }

    I2C_sendStopCondition(I2CB_BASE);

    //
    // Let the stop reach the wire before handing the bus on. Returning
    // the moment STP is requested leaves BB set for the next caller,
    // whose setTargetAddress() is then ignored - which is how a
    // perfectly healthy device ends up looking absent.
    //
    i2cMasterWaitStopComplete();
    return true;
}

//
//=============================================================================
// ADS1119 command-protocol helpers
//=============================================================================
//
// The ADS1119 is command-based, not memory-addressed: an access is a single
// command byte, optionally followed by one data byte (WREG) or by a repeated
// start and a read phase (RREG, RDATA). The F-RAM helpers above always emit
// a 16-bit memory address first and so cannot be used here.
//

//
// Sends a bare single-byte command (RESET, START/SYNC, POWERDOWN).
//
static bool ads1119Command(uint16_t devAddr, uint16_t cmd)
{
    if (!i2cMasterWaitBusFree()) {
        return false;
    }

    I2C_setTargetAddress(I2CB_BASE, devAddr);
    I2C_setConfig(I2CB_BASE, I2C_CONTROLLER_SEND_MODE);
    I2C_setDataCount(I2CB_BASE, 1U);
    I2C_putData(I2CB_BASE, cmd & 0xFFU);
    I2C_sendStartCondition(I2CB_BASE);

    //
    // Wait for the command byte to leave the transmit register before
    // asking for the stop. Setting STP in the same breath as STT tears
    // the transfer down before the byte has been clocked out, so the
    // part never sees the command - it is latched on the eighth falling
    // edge of SCL - and the transaction never completes. The EEPROM
    // helpers above get this right, which is why they worked while every
    // ADS1119 access failed.
    //
    {
        uint32_t guard = 0;
        while ((I2C_getStatus(I2CB_BASE) & I2C_STS_TX_DATA_RDY) == 0U) {
            if (++guard > BTS_I2C_TIMEOUT_ITERATIONS) {
                I2C_sendStopCondition(I2CB_BASE);
                return false;
            }
            if (I2C_getStatus(I2CB_BASE) & I2C_STS_NO_ACK) {
                I2C_clearStatus(I2CB_BASE, I2C_STS_NO_ACK);
                I2C_sendStopCondition(I2CB_BASE);
                return false;
            }
        }
    }

    I2C_sendStopCondition(I2CB_BASE);

    if (!i2cMasterWaitReady()) {
        return false;
    }

    //
    // ARDY only says the module finished its own work; the stop still
    // has to land before the bus belongs to anyone else.
    //
    i2cMasterWaitStopComplete();
    return true;
}

//
// WREG: writes the single 8-bit configuration register.
//
//   S  ADDR W A  WREG A  DATA A  P
//
static bool ads1119WriteConfig(uint16_t devAddr, uint16_t cfg)
{
    if (!i2cMasterWaitBusFree()) {
        return false;
    }

    I2C_setTargetAddress(I2CB_BASE, devAddr);
    I2C_setConfig(I2CB_BASE, I2C_CONTROLLER_SEND_MODE);
    I2C_setDataCount(I2CB_BASE, 2U);
    I2C_putData(I2CB_BASE, ADS1119_CMD_WREG);
    I2C_putData(I2CB_BASE, cfg & 0xFFU);
    I2C_sendStartCondition(I2CB_BASE);

    //
    // Both bytes have to clear the transmit register before the stop is
    // requested - see the note in ads1119Command().
    //
    {
        uint16_t sent;
        for (sent = 0; sent < 2U; sent++) {
            uint32_t guard = 0;
            while ((I2C_getStatus(I2CB_BASE) & I2C_STS_TX_DATA_RDY) == 0U) {
                if (++guard > BTS_I2C_TIMEOUT_ITERATIONS) {
                    I2C_sendStopCondition(I2CB_BASE);
                    return false;
                }
                if (I2C_getStatus(I2CB_BASE) & I2C_STS_NO_ACK) {
                    I2C_clearStatus(I2CB_BASE, I2C_STS_NO_ACK);
                    I2C_sendStopCondition(I2CB_BASE);
                    return false;
                }
            }
        }
    }

    I2C_sendStopCondition(I2CB_BASE);

    if (!i2cMasterWaitReady()) {
        return false;
    }

    //
    // ARDY only says the module finished its own work; the stop still
    // has to land before the bus belongs to anyone else.
    //
    i2cMasterWaitStopComplete();
    return true;
}

//
// Issues a command byte, then a repeated start into a read of count bytes.
// Shared by RREG (1 byte) and RDATA (2 bytes).
//
static bool ads1119ReadAfterCommand(uint16_t devAddr, uint16_t cmd,
                                    uint16_t *bytes, uint16_t count)
{
    uint16_t i;

    if (!i2cMasterWaitBusFree()) {
        return false;
    }

    //
    // Phase 1: the command byte, with no stop - a repeated start follows.
    //
    I2C_setTargetAddress(I2CB_BASE, devAddr);
    I2C_setConfig(I2CB_BASE, I2C_CONTROLLER_SEND_MODE);
    I2C_setDataCount(I2CB_BASE, 1U);
    I2C_putData(I2CB_BASE, cmd & 0xFFU);
    I2C_sendStartCondition(I2CB_BASE);

    if (!i2cMasterWaitReady()) {
        I2C_sendStopCondition(I2CB_BASE);
        return false;
    }

    //
    // Phase 2: repeated start, then read the response.
    //
    I2C_setConfig(I2CB_BASE, I2C_CONTROLLER_RECEIVE_MODE);
    I2C_setDataCount(I2CB_BASE, count);
    I2C_sendStartCondition(I2CB_BASE);

    for (i = 0; i < count; i++) {
        uint32_t guard = 0;
        while ((I2C_getStatus(I2CB_BASE) & I2C_STS_RX_DATA_RDY) == 0U) {
            if (++guard > BTS_I2C_TIMEOUT_ITERATIONS) {
                I2C_sendStopCondition(I2CB_BASE);
                return false;
            }
            if (I2C_getStatus(I2CB_BASE) & I2C_STS_NO_ACK) {
                I2C_clearStatus(I2CB_BASE, I2C_STS_NO_ACK);
                I2C_sendStopCondition(I2CB_BASE);
                return false;
            }
        }
        bytes[i] = I2C_getData(I2CB_BASE) & 0xFFU;
    }

    I2C_sendStopCondition(I2CB_BASE);

    //
    // Let the stop reach the wire before handing the bus on. Returning
    // the moment STP is requested leaves BB set for the next caller,
    // whose setTargetAddress() is then ignored - which is how a
    // perfectly healthy device ends up looking absent.
    //
    i2cMasterWaitStopComplete();
    return true;
}

//
// Identifies a converter. The ADS1119 has no device-ID register, so the only
// available check is that it acknowledges its address and reads back the
// configuration byte just written to it.
//
static bool ads1119Identify(uint16_t devAddr, uint16_t expectedCfg)
{
    uint16_t readback = 0;

    if (!ads1119ReadAfterCommand(devAddr, ADS1119_CMD_RREG_CFG, &readback, 1U)) {
        return false;
    }

    return ((readback & 0xFFU) == (expectedCfg & 0xFFU));
}

//
// A C28x byte is 16 bits wide, so the EEPROM image is packed two bytes per
// word. These helpers convert between the packed on-wire form and the
// in-memory struct.
//
#define CAL_EEPROM_BYTES (2U * (uint16_t)sizeof(BTS_channelCalibration))

