ArakniD/Lion-IRVT/Hardware/source/tida-010086/bts_F2837xD_8ch/com_cpu2.c
    Interrupt_register(BTS_CONSOLE_RX_INT, &uartRxISR);
    Interrupt_enable(BTS_CONSOLE_RX_INT);
#else
    //
    // Production build: GPIO29 drives the WS2812B LED string and GPIO28 is
    // channel 1's trip input, so no console port exists. The host talks to
    // the unit over I2C or CAN instead.
    //
#endif
}

void initTimer(void)
{
    CPUTimer_setPeriod(CPUTIMER1_BASE, DEVICE_SYSCLK_FREQ / 8);
    CPUTimer_setPreScaler(CPUTIMER1_BASE, 0);
    CPUTimer_enableInterrupt(CPUTIMER1_BASE);
    Interrupt_register(INT_TIMER1, &timerISR);
    Interrupt_enable(INT_TIMER1);
    CPUTimer_startTimer(CPUTIMER1_BASE);
}

//
// Brings one converter up, following the start-up sequence in the ADS1119
// datasheet (section 9.2.2): RESET, WREG, optional RREG sanity check, then
// START/SYNC to begin converting continuously.
//
// Returns true if the converter acknowledged and read back the configuration
// it was given. A false return means the part is absent or unreachable; its
// DRDY interrupt is then left masked rather than costing a full set of I2C
// timeouts on every edge.
//
static bool ads1119Start(uint16_t devAddr)
{
    uint16_t cfg = ADS1119_CFG_FOR_CH(0U);

    //
    // Reset first so the part is in a known state regardless of what the
    // shared RESET1/RESET2 line did earlier. No delay is required after the
    // RESET command latches.
    //
    if (!ads1119Command(devAddr, ADS1119_CMD_RESET)) {
        return false;
    }

    if (!ads1119WriteConfig(devAddr, cfg)) {
        return false;
    }

    //
    // The part has no ID register, so this read-back is the identification:
    // it proves both that the address ACKed and that the configuration took.
    //
    if (!ads1119Identify(devAddr, cfg)) {
        return false;
    }

    //
    // CM = 1 alone does not start anything. Continuous conversion begins
    // only on START/SYNC, which must be re-issued whenever CM changes.
    //
    return ads1119Command(devAddr, ADS1119_CMD_START);
}

void initADS1119(void)
{
    bool ok1;
    bool ok2;

    //
    // Pins and interrupt routing first, but the interrupts themselves stay
    // masked: the DRDY ISRs perform blocking I2C transfers, so one firing
    // during the configuration writes below would deadlock against the
    // transfer already in progress.
    //
    //
    // DRDY pins (GPIO42/43) are configured as GPIO inputs by CPU1. The XINT
    // routing and edge selection are not pin-mux registers, so CPU2 sets
    // those itself.
    //
    GPIO_setInterruptPin(ADS1119_DRDY_GPIO_1, GPIO_INT_XINT1);
    GPIO_setInterruptType(GPIO_INT_XINT1, GPIO_INT_TYPE_FALLING_EDGE);
    GPIO_setInterruptPin(ADS1119_DRDY_GPIO_2, GPIO_INT_XINT2);
    GPIO_setInterruptType(GPIO_INT_XINT2, GPIO_INT_TYPE_FALLING_EDGE);

    Interrupt_register(INT_XINT1, &ads1119Drdy1ISR);
    Interrupt_register(INT_XINT2, &ads1119Drdy2ISR);

    //
    // Configure both converters for channel 0 and start them converting.
    // CPU1 pulses the shared RESET1/RESET2 lines during its own start-up,
    // well before it releases CPU2, so the reset cannot land after these
    // writes and silently return the configuration register to 00h.
    //
    ok1 = ads1119Start(ADS1119_ADDR_1);
    ok2 = ads1119Start(ADS1119_ADDR_2);

    currentAdsChannel[0] = 0U;
    currentAdsChannel[1] = 0U;
    adsFailCount[0] = ok1 ? 0U : ADS1119_MAX_CONSECUTIVE_FAILURES;
    adsFailCount[1] = ok2 ? 0U : ADS1119_MAX_CONSECUTIVE_FAILURES;

#if (BTS_CONSOLE_ENABLED == true)
    uartSendResponse(ok1 ? "ADS1119 @0x40 ok" : "ADS1119 @0x40 not found");
    uartSendResponse(ok2 ? "ADS1119 @0x41 ok" : "ADS1119 @0x41 not found");
#endif

    //
    // Now the bus is idle, accept DRDY. Clear anything the PIE latched while
    // the converters were being configured, otherwise a stale edge fires the
    // ISR immediately and it contends with this still-unfinished init.
    //
    Interrupt_clearACKGroup(INTERRUPT_ACK_GROUP1);

    if (ok1) {
        GPIO_enableInterrupt(GPIO_INT_XINT1);
        Interrupt_enable(INT_XINT1);
    }
    if (ok2) {
        GPIO_enableInterrupt(GPIO_INT_XINT2);
        Interrupt_enable(INT_XINT2);
    }
}

float mVToTemperature(float mV)
{
    if (mV <= mvToTempTable[0].mV) return mvToTempTable[0].tempC;
    if (mV >= mvToTempTable[MV_TO_TEMP_TABLE_SIZE-1].mV) return mvToTempTable[MV_TO_TEMP_TABLE_SIZE-1].tempC;

    for (uint16_t i = 0; i < MV_TO_TEMP_TABLE_SIZE-1; i++) {
        if (mV >= mvToTempTable[i].mV && mV < mvToTempTable[i+1].mV) {
            float mVRange = mvToTempTable[i+1].mV - mvToTempTable[i].mV;
            float tempRange = mvToTempTable[i+1].tempC - mvToTempTable[i].tempC;
            return mvToTempTable[i].tempC + (mV - mvToTempTable[i].mV) * tempRange / mVRange;
        }
    }
    return 0.0f;
}

float readADS1119Data(uint16_t adsAddr, uint16_t channel)
{
    uint16_t data[2];
    int16_t raw;
    float mV;
    uint16_t unit = (adsAddr == ADS1119_ADDR_1) ? 0U : 1U;

    (void)channel;

    //
    // RDATA, then a repeated start and two bytes MSB first.
    //
    if (!ads1119ReadAfterCommand(adsAddr, ADS1119_CMD_RDATA, data, 2U)) {
        //
        // No response. Give up on this converter after a run of failures so a
        // missing device cannot monopolise the CPU.
        //
        if (adsFailCount[unit] < ADS1119_MAX_CONSECUTIVE_FAILURES) {
            adsFailCount[unit]++;
            if (adsFailCount[unit] >= ADS1119_MAX_CONSECUTIVE_FAILURES) {
                GPIO_disableInterrupt((unit == 0U) ? GPIO_INT_XINT1
                                                   : GPIO_INT_XINT2);
            }
        }
        return 0.0f;
    }

    adsFailCount[unit] = 0;

    //
    // Bipolar 16-bit result against the external 2.50 V reference on
    // REFP/REFN, not the internal 2.048 V.
    //
    raw = (int16_t)(((data[0] & 0xFFU) << 8) | (data[1] & 0xFFU));
    mV = ((float)raw * ADS1119_VREF_MV) / ADS1119_FULL_SCALE;

    return mVToTemperature(mV);
}

//
// Points the converter's multiplexer at the next thermistor. Writing the
// configuration register restarts the conversion by itself, so no further
// START/SYNC is needed here.
//
void configureNextChannel(uint16_t adsAddr, uint16_t nextChannel)
{
    ads1119WriteConfig(adsAddr, ADS1119_CFG_FOR_CH(nextChannel));
}

//
// Publishes one channel's measured temperature.
//
// This goes to eChX_CellTemp (RO), NOT to the min/max pair at 512: that pair
// is the configured trip window, is mirrored into the F-RAM calibration
// image, and writing a measurement over it destroys the configuration.
//
// A failed read is left out of the register file entirely rather than
// published as 0.0 degrees C, which would read as a plausible temperature.
//
static void publishCellTemp(uint16_t channel, float temp, bool valid)
{
    if (!valid) {
        return;
    }

    registers[BTS_CELLTEMP_IDX(channel)] = temp;

    //
    // Advisory to CPU1's control loops; the value is already settled in
    // registers[] before the flag is raised. Non-blocking: if the previous
    // notification has not been acknowledged the update is simply skipped,
    // since CPU1 re-reads the register anyway.
    //
    if (!IPC_isFlagBusyLtoR(IPC_CPU2_L_CPU1_R, BTS_IPC_FLAG_TEMP_UPDATE)) {
        IPC_setFlagLtoR(IPC_CPU2_L_CPU1_R, BTS_IPC_FLAG_TEMP_UPDATE);
    }
}

