ArakniD/Lion-IRVT/Hardware/source/tida-010086/bts_F2837xD_8ch/com_cpu2.c
#pragma CODE_SECTION(ads1119Drdy1ISR, "isrcodefuncs")
#pragma INTERRUPT(ads1119Drdy1ISR, HPI)
__interrupt void ads1119Drdy1ISR(void)
{
    uint16_t channel = currentAdsChannel[0];
    float temp = readADS1119Data(ADS1119_ADDR_1, channel);

    publishCellTemp(channel, temp, (adsFailCount[0] == 0U));

    currentAdsChannel[0] = (currentAdsChannel[0] + 1U) % ADS1119_CHANNELS_PER_DEV;
    configureNextChannel(ADS1119_ADDR_1, currentAdsChannel[0]);

    Interrupt_clearACKGroup(INTERRUPT_ACK_GROUP1);
}

#pragma CODE_SECTION(ads1119Drdy2ISR, "isrcodefuncs")
#pragma INTERRUPT(ads1119Drdy2ISR, HPI)
__interrupt void ads1119Drdy2ISR(void)
{
    uint16_t channel = currentAdsChannel[1];
    float temp = readADS1119Data(ADS1119_ADDR_2, channel);

    publishCellTemp(channel + ADS1119_CHANNELS_PER_DEV, temp,
                    (adsFailCount[1] == 0U));

    currentAdsChannel[1] = (currentAdsChannel[1] + 1U) % ADS1119_CHANNELS_PER_DEV;
    configureNextChannel(ADS1119_ADDR_2, currentAdsChannel[1]);

    Interrupt_clearACKGroup(INTERRUPT_ACK_GROUP1);
}

//
// Mirrors the measurements and status CPU1 published in CPU1TOCPU2RAM into
// the register file, so the external interfaces see current data. The seq
// counter is even and unchanged across a consistent snapshot.
//
static void mirrorCpu1Status(void)
{
    uint32_t seqBefore;
    uint32_t statusBits[NUM_CHANNELS];
    float32_t cellV[NUM_CHANNELS];
    float32_t cellI[NUM_CHANNELS];
    float32_t inputV;
    uint32_t unitState;
    uint32_t tripStatus;
    uint32_t strapsValid;
    uint32_t slotMode;
    uint32_t slotEnable;
    uint32_t groupSize;
    uint16_t ch;
    uint16_t attempts = 0;

    do {
        seqBefore = cpu1Status.seq;
        if (seqBefore & 1U) {
            continue;   // CPU1 is mid-update
        }
        for (ch = 0; ch < NUM_CHANNELS; ch++) {
            statusBits[ch] = cpu1Status.statusBits[ch];
            cellV[ch] = cpu1Status.cellVoltage[ch];
            cellI[ch] = cpu1Status.cellCurrent[ch];
        }
        inputV     = cpu1Status.inputVoltage;
        unitState  = cpu1Status.unitState;
        tripStatus = cpu1Status.tripStatus;
        strapsValid = cpu1Status.strapsValid;
        slotMode    = cpu1Status.slotMode;
        slotEnable  = cpu1Status.slotEnable;
        groupSize   = cpu1Status.groupSize;
    } while (cpu1Status.seq != seqBefore && ++attempts < 4U);

    if (attempts >= 4U) {
        return;   // could not get a clean snapshot; try again next tick
    }

    for (ch = 0; ch < NUM_CHANNELS; ch++) {
        registers[BTS_CTRL_BASE(ch) + BTS_REG_IDX(eCh0_Status)] = (float32_t)statusBits[ch];
        registers[BTS_STATS_BASE(ch) + (BTS_REG_IDX(eCh0_CellVoltage) - BTS_REG_IDX(eCh0_CurrentAcc))] = cellV[ch];
        registers[BTS_STATS_BASE(ch) + (BTS_REG_IDX(eCh0_CellCurrent) - BTS_REG_IDX(eCh0_CurrentAcc))] = cellI[ch];
    }

    registers[BTS_REG_IDX(eInputVoltage)] = inputV;
    registers[BTS_REG_IDX(eUnitState)]    = (float32_t)unitState;
    registers[BTS_REG_IDX(eTripStatus)]   = (float32_t)tripStatus;

    //
    // Dip-switch straps. Only published once CPU1 says it has latched
    // them - the two cores boot independently, and this message RAM is
    // NOLOAD from CPU2's side, so before that the values are whatever the
    // RAM powered up holding.
    //
    if (strapsValid != 0U) {
        registers[BTS_REG_IDX(eSlotMode)]   = (float32_t)slotMode;
        registers[BTS_REG_IDX(eSlotEnable)] = (float32_t)slotEnable;
        registers[BTS_REG_IDX(eGroupSize)]  = (float32_t)groupSize;
    }
}

static volatile uint16_t canTxChannel = 0;

#pragma CODE_SECTION(timerISR, "isrcodefuncs")
#pragma INTERRUPT(timerISR, HPI)
__interrupt void timerISR(void)
{
    mirrorCpu1Status();
    sendCANData(canTxChannel);
    canTxChannel = (canTxChannel + 1) % NUM_CHANNELS;
    CPUTimer_clearOverflowFlag(CPUTIMER1_BASE);
    //
    // CPU Timer 1 is connected directly to CPU INT13, not through the PIE,
    // so there is no acknowledge group to clear.
    //
}

volatile uint16_t currentRegAddr = 0;
volatile uint16_t byteCount = 0;
volatile float tempData = 0.0f;
volatile uint16_t isWrite = 0;
static uint16_t readBuffer[4] = {0};
static volatile uint16_t bufferValid = 0;

//
// Applies a host register write from any interface (I2C, UART or CAN).
// Writes the register file, notifies CPU1, and handles the eCalibrationMode
// commit trigger.
//
static void applyHostRegisterWrite(uint16_t regIdx, float32_t value)
{
    registers[regIdx] = value;
    notifyCpu1RegisterWrite(regIdx, value);

    if (regIdx == BTS_REG_IDX(eCalibrationMode) && value == 2.0f) {
        saveAllCalibration();
    }
}

//
// The register protocol carries each float MSB-first on the wire. A C28x
// "byte" is 16 bits, so a float is two 16-bit words rather than four bytes -
// indexing it as a byte array (as older revisions did) runs off the end of
// the object. These helpers pack and unpack explicitly:
//
//   wire byte 0 -> bits 31..24   word[1] high half
//   wire byte 1 -> bits 23..16   word[1] low half
//   wire byte 2 -> bits 15..8    word[0] high half
//   wire byte 3 -> bits  7..0    word[0] low half
//
static inline void floatPutWireByte(volatile float32_t *f, uint16_t index, uint16_t value)
{
    volatile uint16_t *w = (volatile uint16_t *)f;
    uint16_t word = 1U - (index >> 1);       // bytes 0,1 -> word 1; 2,3 -> word 0
    if ((index & 1U) == 0U) {
        w[word] = (w[word] & 0x00FFU) | ((value & 0xFFU) << 8);   // high half
    } else {
        w[word] = (w[word] & 0xFF00U) | (value & 0xFFU);          // low half
    }
}

static inline uint16_t floatGetWireByte(float32_t f, uint16_t index)
{
    const uint16_t *w = (const uint16_t *)&f;
    uint16_t word = 1U - (index >> 1);
    return ((index & 1U) == 0U) ? ((w[word] >> 8) & 0xFFU) : (w[word] & 0xFFU);
}

#pragma CODE_SECTION(i2cSlaveISR, "isrcodefuncs")
#pragma INTERRUPT(i2cSlaveISR, HPI)
__interrupt void i2cSlaveISR(void)
{
    uint32_t intSource = I2C_getInterruptStatus(I2CA_BASE);

    if (intSource & I2C_INT_ADDR_TARGET) {
        isWrite = (I2C_getStatus(I2CA_BASE) & I2C_STS_TARGET_DIR) ? 0 : 1;
        byteCount = 0;
        tempData = 0.0f;
        currentRegAddr = 0;
        bufferValid = 0;
    }

    if (intSource & I2C_INT_STOP_CONDITION) {
        byteCount = 0;
        bufferValid = 0;
    }

